cases/validation/diag_sst/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|  Transport properties -- Phase-1 clean-section 2D validation case           |
|  Instantiated from cases/validation_2d/template by                          |
|  scripts/build_validation_case.py                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Kinematic viscosity from aircraft.yaml (atmosphere.kinematic_viscosity,
// ISA sea level). The 2D convention is c = 1 m and U = Re * nu / c, so with
// THIS nu the chord Reynolds number reproduces the requested Re = 3e6
// exactly: Re_check = U * c / nu = 43.821 * 1 / 1.4607e-05.

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.4607e-05;

// ************************************************************************* //
