cases/validation/diag_sst/system/yPlusObj
/*--------------------------------*- C++ -*----------------------------------*\
|  Wall y+ function object -- Phase-1 clean-section 2D validation case        |
|  Instantiated from cases/validation_2d/template by                          |
|  scripts/build_validation_case.py                                           |
\*---------------------------------------------------------------------------*/

// Mechanism: writes the y+ FIELD into each write-time directory (the per-
// face evidence) plus min/max/average per patch to the solver log and to
// postProcessing/yPlus1/<time>/yPlus.dat. scripts/parse_forces.py
// yplus_verdict() evaluates spec section 4 from those outputs: it prints
// the per-case y+ histogram from the written field and FAILS the case when
// y+ > 2 on more than 1% of the airfoil wall faces (falling back to the
// conservative max-y+ <= 2 rule when only the log stats survive). The
// design target itself is y+ < 1 everywhere -- the mesh generator sizes the
// first cell from the flat-plate correlation chain in
// scripts/first_cell_height.py.

yPlus1
{
    type            yPlus;
    libs            (fieldFunctionObjects);

    // Field at write times is enough: y+ is a verification quantity, not a
    // convergence monitor.
    writeControl    writeTime;
}

// ************************************************************************* //
